; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite6 - satellite
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	satellite7 - satellite
	instrument18 - instrument
	instrument19 - instrument
	instrument20 - instrument
	satellite8 - satellite
	instrument21 - instrument
	instrument22 - instrument
	instrument23 - instrument
	spectrograph1 - mode
	thermograph2 - mode
	image3 - mode
	infrared0 - mode
	Star1 - direction
	GroundStation4 - direction
	Star3 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph1)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 thermograph2)
	(supports instrument6 image3)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
	(supports instrument7 image3)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 image3)
	(calibration_target instrument8 Star1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star8)
	(supports instrument9 image3)
	(calibration_target instrument9 GroundStation0)
	(supports instrument10 thermograph2)
	(supports instrument10 image3)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation0)
	(supports instrument11 image3)
	(supports instrument11 infrared0)
	(calibration_target instrument11 Star3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star3)
	(supports instrument12 thermograph2)
	(calibration_target instrument12 GroundStation4)
	(supports instrument13 infrared0)
	(supports instrument13 image3)
	(supports instrument13 thermograph2)
	(calibration_target instrument13 GroundStation0)
	(supports instrument14 thermograph2)
	(supports instrument14 spectrograph1)
	(calibration_target instrument14 Star3)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star6)
	(supports instrument15 image3)
	(supports instrument15 infrared0)
	(calibration_target instrument15 GroundStation4)
	(supports instrument16 image3)
	(calibration_target instrument16 Star3)
	(supports instrument17 spectrograph1)
	(supports instrument17 thermograph2)
	(calibration_target instrument17 GroundStation2)
	(on_board instrument15 satellite6)
	(on_board instrument16 satellite6)
	(on_board instrument17 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation2)
	(supports instrument18 thermograph2)
	(supports instrument18 infrared0)
	(calibration_target instrument18 Star3)
	(supports instrument19 image3)
	(calibration_target instrument19 GroundStation2)
	(supports instrument20 thermograph2)
	(supports instrument20 image3)
	(calibration_target instrument20 GroundStation4)
	(on_board instrument18 satellite7)
	(on_board instrument19 satellite7)
	(on_board instrument20 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star8)
	(supports instrument21 infrared0)
	(supports instrument21 thermograph2)
	(supports instrument21 image3)
	(calibration_target instrument21 Star3)
	(supports instrument22 spectrograph1)
	(calibration_target instrument22 GroundStation0)
	(supports instrument23 infrared0)
	(supports instrument23 image3)
	(calibration_target instrument23 GroundStation2)
	(on_board instrument21 satellite8)
	(on_board instrument22 satellite8)
	(on_board instrument23 satellite8)
	(power_avail satellite8)
	(pointing satellite8 GroundStation4)
)
(:goal (and
	(pointing satellite2 Star3)
	(pointing satellite3 Star5)
	(pointing satellite4 Star3)
	(pointing satellite6 Star3)
	(pointing satellite7 Star3)
	(pointing satellite8 Star6)
	(have_image Star5 spectrograph1)
	(have_image Star6 infrared0)
	(have_image Planet7 image3)
	(have_image Star8 infrared0)
	(have_image Star9 spectrograph1)
))

)

; plan
1. (turn_to satellite7 star3 star8)
   deleted: (pointing satellite7 star8)
   added: (pointing satellite7 star3)
   goals met: 2 of 11
2. (turn_to satellite6 star3 groundstation2)
   deleted: (pointing satellite6 groundstation2)
   added: (pointing satellite6 star3)
   goals met: 3 of 11
3. (turn_to satellite3 star5 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 star5)
   goals met: 4 of 11
4. (turn_to satellite2 star3 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star3)
   goals met: 5 of 11
5. (turn_to satellite1 groundstation4 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 groundstation4)
   goals met: 5 of 11
6. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 5 of 11
7. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 5 of 11
8. (turn_to satellite1 star5 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star5)
   goals met: 5 of 11
9. (take_image satellite1 star5 instrument3 spectrograph1)
   added: (have_image star5 spectrograph1)
   goals met: 6 of 11
10. (turn_to satellite1 planet7 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet7)
   goals met: 6 of 11
11. (take_image satellite1 planet7 instrument3 image3)
   added: (have_image planet7 image3)
   goals met: 7 of 11
12. (turn_to satellite1 star6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star6)
   goals met: 7 of 11
13. (take_image satellite1 star6 instrument3 infrared0)
   added: (have_image star6 infrared0)
   goals met: 8 of 11
14. (turn_to satellite1 star8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star8)
   goals met: 8 of 11
15. (take_image satellite1 star8 instrument3 infrared0)
   added: (have_image star8 infrared0)
   goals met: 9 of 11
16. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 9 of 11
17. (take_image satellite1 star9 instrument3 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 10 of 11
18. (turn_to satellite8 star6 groundstation4)
   deleted: (pointing satellite8 groundstation4)
   added: (pointing satellite8 star6)
   goals met: 11 of 11
